[
  {
    "title":"Signature Growth Mutual Fund Strategy",
    "text":"This combination of mutual funds is designed for an investor who has a 10 or more year time horizon for the funds they are investing.  These investors have a longer time horizon and want investments that will afford growth with a reasonable amount of volatility.  The Growth Mutual Fund Strategy seeks to smooth out the ups and downs of the market, while providing growth that meets long term investment goals."
  },
  {
    "title":"Signature Balanced Mutual Fund Strategy",
    "text":"The balanced strategy is designed for an investor with a 5-10 year time horizon for the funds they are committing to invest.  These investors are willing to accept a slightly lower return than longer time horizon investors in exchange for less volatility.  Therefore the asset allocation is different than the growth investor.  Many of the underlying investments are the same, but the weightings will be different and favor the less volatile investments that are not as growth oriented and more balanced."
  },
  {
    "title":"Signature Conservative Mutual Fund Strategy",
    "text":"The conservative strategy is designed with the pre-retiree and retiree in mind.  These investors will typically have less than 5 year time horizon for potential usage of the funds.  With this in mind, this investor is even less risk tolerant than the balanced investor. This investor is seeking preservation of capital with growth as a secondary objective. Therefore, the funds selected will be primarily short-duration fixed income funds with a modest allocation to conservative growth-oriented funds."
  },
  {
    "title":"Signature Income Mutual Fund Strategy",
    "text":"The income strategy is designed to provide a current income stream for an investor who may be relying on the asset’s income to provide current cash-flow.  The asset allocation favors income producing investments in the form of dividend yield.  This investor has a similar risk tolerance as the conservative investor and also requires current income in the portfolio."
  },
  {
    "title":"Signature Tax Efficient Mutual Fund Strategy",
    "text":"The tax-efficient strategy is designed for investors who have excess cash in non-retirement accounts.  This strategy offers a less volatile option to investors than the growth or balanced strategies and has enhanced tax-efficiency accomplished by the addition of municipal bond exposure."
  }
]
